# GetFileBasedTempFolder Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalFileUtils..::..GetFileBasedTempFolder Method
ExternalFileUtils Class See Also
---
Gets a temp folder based on the given file name
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static string GetFileBasedTempFolder(
	string filename
)
```

Visual Basic
---
```text
Public Shared Function GetFileBasedTempFolder ( _
	filename As String _
) As String
```

Visual C++
---
```text
public:
static String^ GetFileBasedTempFolder(
	String^ filename
)
```

# ### Parameters
filename
    Type: System..::..String
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExternalFileUtils Class
Autodesk.Revit.DB Namespace